---
type: IPrintSetting
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# IPrintSetting

`Autodesk.Revit.DB.IPrintSetting` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | PrintParameters | — | `PrintParameters PrintParameters { get ; }` |